In [1]:
print("hello")

hello

In [1]:
import pandas as pd

In [2]:
import pandas as pd
data=[1,2,3,4,5]
sersi=pd.Series(data)
print("Series are following:\n",sersi)
print(type(sersi))

Series are following:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
dat=[10,20,30]
idex=['a','b','c']
pd.Series(dat,index=idex)

a    10
b    20
c    30
dtype: int64

In [8]:
import pandas as pd
df = pd.read_csv('Sales_Data.csv')
(df.head(4))

   TransactionID  Year   Balance   Name
0          49072  1954      1000   John
1          39412  1987    100000  Krish
2          10003  2020  10000000  Sumit

In [9]:
df

   TransactionID  Year   Balance   Name
0          49072  1954      1000   John
1          39412  1987    100000  Krish
2          10003  2020  10000000  Sumit

In [10]:
data

[1, 2, 3, 4, 5]

In [11]:
type(df['Price'])

KeyError: 'Price'

In [12]:
df.loc[2][1]

C:\Users\HP\AppData\Local\Temp\ipykernel_24544\875231754.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[2][1]

np.int64(2020)

In [13]:
df

   TransactionID  Year   Balance   Name
0          49072  1954      1000   John
1          39412  1987    100000  Krish
2          10003  2020  10000000  Sumit

In [14]:
df.drop('Region',axis= 1,inplace=True)

KeyError: "['Region'] not found in axis"

In [38]:
df

   TransactionID  Year   Balance   Name
0          49072  1954      1000   John
1          39412  1987    100000  Krish
2          10003  2020  10000000  Sumit

In [37]:
df.describe()

       TransactionID    Year       Balance
count        3.00000     3.0  3.000000e+00
mean     32829.00000  1987.0  3.367000e+06
std      20349.41294    33.0  5.744560e+06
min      10003.00000  1954.0  1.000000e+03
25%      24707.50000  1970.5  5.050000e+04
50%      39412.00000  1987.0  1.000000e+05
75%      44242.00000  2003.5  5.050000e+06
max      49072.00000  2020.0  1.000000e+07

In [10]:
import os
print(os.getcwd())

c:\Users\HP\Desktop\Data analyst bootcamp\Python\10-Data_Analysis_With_Python

In [40]:
import pandas as pd
df=pd.read_csv('Data.csv')
df.head(5)
df.tail(3)

          Date Category  Value   Product  Sales Region
17  2023-01-18      NaN    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        4   59.0  Product1  736.0   East

In [71]:
df.isnull().any(axis=1).head(3)

0    False
1    False
2    False
dtype: bool

In [72]:
df.isnull().sum()

Date        0
Category    1
Value       2
Product     0
Sales       1
Region      0
dtype: int64

In [79]:
df_filled=df.fillna(0)

In [99]:
df

,Date,Category,Value,Product,Sales,Region,value_fillNA,New_Value
0,2023-01-01,A,28.000000,Product1,754.0,East,28.000000,28
1,2023-01-02,B,39.000000,Product3,110.0,North,39.000000,39
2,2023-01-03,C,32.000000,Product2,398.0,East,32.000000,32
3,2023-01-04,B,8.000000,Product1,522.0,East,8.000000,8
4,2023-01-05,B,26.000000,Product3,869.0,North,26.000000,26
5,2023-01-06,B,54.000000,Product3,192.0,West,54.000000,54
6,2023-01-07,A,16.000000,Product1,936.0,East,16.000000,16
7,2023-01-08,C,89.000000,Product1,488.0,West,89.000000,89
8,2023-01-09,C,37.000000,Product3,772.0,West,37.000000,37
9,2023-01-10,A,22.000000,Product2,834.0,West,22.000000,22
10,2023-01-11,B,7.000000,Product1,842.0,North,7.000000,7
11,2023-01-12,B,60.000000,Product2,NaN,West,60.000000,60
12,2023-01-13,A,70.000000,Product3,628.0,South,70.000000,70
13,2023-01-14,A,69.000000,Product1,423.0,East,69.000000,69
14,2023-01-15,A,47.000000,Product2,893.0,West,47.000000,47
15,2023-01-16,C,43.722222,Product1,895.0,North,43.722222,43
16,2023-01-17,C,93.000000,Product2,511.0,South,93.000000,93
17,2023-01-18,NaN,43.722222,Product1,108.0,West,43.722222,43
18,2023-01-19,A,31.000000,Product2,578.0,West,31.000000,31
19,2023-01-20,4,59.000000,Product1,736.0,East,59.000000,59

In [95]:
df['Value']=df['Value'].fillna(df['Value'].mean())
df

          Date Category      Value   Product  Sales Region  value_fillNA
0   2023-01-01        A  28.000000  Product1  754.0   East     28.000000
1   2023-01-02        B  39.000000  Product3  110.0  North     39.000000
2   2023-01-03        C  32.000000  Product2  398.0   East     32.000000
3   2023-01-04        B   8.000000  Product1  522.0   East      8.000000
4   2023-01-05        B  26.000000  Product3  869.0  North     26.000000
5   2023-01-06        B  54.000000  Product3  192.0   West     54.000000
6   2023-01-07        A  16.000000  Product1  936.0   East     16.000000
7   2023-01-08        C  89.000000  Product1  488.0   West     89.000000
8   2023-01-09        C  37.000000  Product3  772.0   West     37.000000
9   2023-01-10        A  22.000000  Product2  834.0   West     22.000000
10  2023-01-11        B   7.000000  Product1  842.0  North      7.000000
11  2023-01-12        B  60.000000  Product2    NaN   West     60.000000
12  2023-01-13        A  70.000000  Product3  628.0  South     70.000000
13  2023-01-14        A  69.000000  Product1  423.0   East     69.000000
14  2023-01-15        A  47.000000  Product2  893.0   West     47.000000
15  2023-01-16        C  43.722222  Product1  895.0  North     43.722222
16  2023-01-17        C  93.000000  Product2  511.0  South     93.000000
17  2023-01-18      NaN  43.722222  Product1  108.0   West     43.722222
18  2023-01-19        A  31.000000  Product2  578.0   West     31.000000
19  2023-01-20        4  59.000000  Product1  736.0   East     59.000000

In [108]:
df['Sales'].fillna(df['Sales'].mean())

0     754.000000
1     110.000000
2     398.000000
3     522.000000
4     869.000000
5     192.000000
6     936.000000
7     488.000000
8     772.000000
9     834.000000
10    842.000000
11    604.684211
12    628.000000
13    423.000000
14    893.000000
15    895.000000
16    511.000000
17    108.000000
18    578.000000
19    736.000000
Name: Sales, dtype: float64

In [112]:
df['New_Sales']=df['Sales'].fillna(df['Sales'].mean()).astype(int)
df

,Date,Category,Value,Product,Sales,Region,value_fillNA,New_Value,New_Sales
0,2023-01-01,A,28.000000,Product1,754.0,East,28.000000,28,754
1,2023-01-02,B,39.000000,Product3,110.0,North,39.000000,39,110
2,2023-01-03,C,32.000000,Product2,398.0,East,32.000000,32,398
3,2023-01-04,B,8.000000,Product1,522.0,East,8.000000,8,522
4,2023-01-05,B,26.000000,Product3,869.0,North,26.000000,26,869
5,2023-01-06,B,54.000000,Product3,192.0,West,54.000000,54,192
6,2023-01-07,A,16.000000,Product1,936.0,East,16.000000,16,936
7,2023-01-08,C,89.000000,Product1,488.0,West,89.000000,89,488
8,2023-01-09,C,37.000000,Product3,772.0,West,37.000000,37,772
9,2023-01-10,A,22.000000,Product2,834.0,West,22.000000,22,834
10,2023-01-11,B,7.000000,Product1,842.0,North,7.000000,7,842
11,2023-01-12,B,60.000000,Product2,NaN,West,60.000000,60,604
12,2023-01-13,A,70.000000,Product3,628.0,South,70.000000,70,628
13,2023-01-14,A,69.000000,Product1,423.0,East,69.000000,69,423
14,2023-01-15,A,47.000000,Product2,893.0,West,47.000000,47,893
15,2023-01-16,C,43.722222,Product1,895.0,North,43.722222,43,895
16,2023-01-17,C,93.000000,Product2,511.0,South,93.000000,93,511
17,2023-01-18,NaN,43.722222,Product1,108.0,West,43.722222,43,108
18,2023-01-19,A,31.000000,Product2,578.0,West,31.000000,31,578
19,2023-01-20,4,59.000000,Product1,736.0,East,59.000000,59,736

In [118]:
grouped_sum=df.groupby(['Product','Region'])['Value'].sum()
grouped_sum

Product   Region
Product1  East      180.000000
          North      50.722222
          West      132.722222
Product2  East       32.000000
          South      93.000000
          West      160.000000
Product3  North      65.000000
          South      70.000000
          West       91.000000
Name: Value, dtype: float64

In [ ]:
grouped_mean=df.groupby(['Product'])['Value'].mean()
grouped_mean

Product
Product1    40.382716
Product2    47.500000
Product3    45.200000
Name: Value, dtype: float64

: